Buit-in Function
- isset(): តើមានបានបញ្ជូនតំលៃមកទេ?
- empty(): តើទទេ ទេ?
- trim(): កាត់ space សងខាង
- strtolower(): ធ្វើឲ្យអក្សរតូចទាំងអស់
- strtoupper(): ធ្វើឲ្យអក្សរធំទាំងអស់
- str_replace(): ជំនួស
- ucwords(): ធ្វើឲ្យអក្សរមុខពាក្យជាអក្សរធំ​ Ex: Angkor University
- ucfirst(): ធ្វើឲ្យអក្សរមុខប្រយោគជាអក្សរធំ Ex: I go home.
- strlen(): រាប់ចំនួនតួអក្សរ

Client Side Check: HTML 5, JavaScript

Server Side Check: PHP

Domain: ដែនកំណត់
    ភេទ៖ ប្រុស, ស្រី
    ខេត្តកំណើត៖ ទាំង២៥
    មុខវិជ្ជា៖ គណិតវិទ្យា, រូបវិទ្យា, គីមីវិទ្យា, ជីវវិទ្យា, ភាសាអង់គ្លេស, ភាសាបារាំង, ភាសាចិន, ភាសាជប៉ុន, ភាសាកូរ៉េ, ប្រវត្តិសាស្ត្រ, ភូមិសាស្ត្រ, សិល្បៈ, ទស្សនាវិជ្ជា, សង្គមវិទ្យា, ព័ត៌មានវិទ្យា